docs/diagramas.md
```mermaid
flowchart LR
  V([Visitante])
  U([Usuário autenticado])
  subgraph API de avaliações de produtos
    UC01([UC01 Cadastrar conta])
    UC02([UC02 Realizar login])
    UC04([UC04 Pesquisar produto])
    UC05([UC05 Consultar detalhes])
    UC06([UC06 Cadastrar produto])
    UC07([UC07 Editar produto])
    UC11([UC11 Excluir produto])
    UC08([UC08 Cadastrar avaliação])
    UC09([UC09 Editar avaliação])
    UC10([UC10 Excluir avaliação])
    UC12([UC12 Consultar própria conta])
    UC13([UC13 Consultar próprias avaliações])
    UC14([UC14 Consultar próprios produtos])
    UC15([UC15 Confirmar e-mail])
    UC16([UC16 Recuperar senha])
  end
  V --- UC01 & UC02 & UC04 & UC05
  V --- UC15 & UC16
  U --- UC04 & UC05 & UC06 & UC07 & UC11
  U --- UC08 & UC09 & UC10
  U --- UC12 & UC13 & UC14
```
